# Content
1. Import Libraries
2. Import Data
3. Data Combining TASK

# 01 IMporting Libraries

In [1]:
# Import Libraries
import pandas as pd
import numpy as np
import os

# 02 Importing data

In [2]:
path = r'C:\Users\tlayt\OneDrive\Documents\CF Data Analytics\Acheivement 4\Instacart Basket Analysis'

In [3]:
#import data
df_prods = pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'Products_checked.csv'), index_col = False)

In [4]:
#importing combinded pkl data
orders_products_combined = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_combined.pkl'))

# 03 Merging

In [5]:
#checking
df_prods.shape

(49672, 6)

In [6]:
#cecking
df_prods.head()

,Unnamed: 0,product_id,product_name,aisle_id,department_id,prices
0,0,1,Chocolate Sandwich Cookies,61,19,5.8
1,1,2,All-Seasons Salt,104,13,9.3
2,2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,4,5,Green Chile Anytime Sauce,5,13,4.3

In [7]:
#checking
orders_products_combined.shape

(32434489, 10)

In [8]:
#checking
orders_products_combined.head()

,order_id,customer_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,_merge
0,2539329,1,1,2,8,NaN,196,1,0,both
1,2539329,1,1,2,8,NaN,14084,2,0,both
2,2539329,1,1,2,8,NaN,12427,3,0,both
3,2539329,1,1,2,8,NaN,26088,4,0,both
4,2539329,1,1,2,8,NaN,26405,5,0,both

In [ ]:
#dropping unnamed column -- not sure why this is showing up. Has no need. 
df_prods = df_prods.drop(columns = ['Unnamed: 0'])

In [21]:
df_prods.head()

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3

In [23]:
#dropping the merge column at the end to create new df with new merge column with secondary merge
ords_prods_comb_1 = orders_products_combined.drop(columns = ['_merge'])

In [24]:
#combining on product_id
df_merged_all = ords_prods_comb_1.merge(df_prods, on = 'product_id', indicator = True)

In [25]:
#checking
df_merged_all.head()

,order_id,customer_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,product_name,aisle_id,department_id,prices,_merge
0,2539329,1,1,2,8,NaN,196,1,0,Soda,77,7,9.0,both
1,2398795,1,2,3,7,15.0,196,1,1,Soda,77,7,9.0,both
2,473747,1,3,3,12,21.0,196,1,1,Soda,77,7,9.0,both
3,2254736,1,4,4,7,29.0,196,1,1,Soda,77,7,9.0,both
4,431534,1,5,4,15,28.0,196,1,1,Soda,77,7,9.0,both

In [26]:
df_merged_all.shape

(32404859, 14)

In [27]:
# Export data to pkl

df_merged_all.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'orders_products_merged.pkl'))

In [28]:
# Export data to pkl

df_merged_all.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'orders_products_merged_1.pkl'))